In [1]:
import pandas as pd

# Creamos un Dataset

In [179]:
df = pd.DataFrame(data={"Pais":['Mexico','Argentina','Espana','Colombia'],
                        "Poblacion":[127212000, 45167000, 47099000, 48922000]})

In [180]:
df

        Pais  Poblacion
0     Mexico  127212000
1  Argentina   45167000
2     Espana   47099000
3   Colombia   48922000

## Ordenamos por columna

In [181]:
#por poblacion
df = df.sort_values('Poblacion')
df

        Pais  Poblacion
1  Argentina   45167000
2     Espana   47099000
3   Colombia   48922000
0     Mexico  127212000

In [182]:
# por pais
df = df.sort_values('Pais')
df

        Pais  Poblacion
1  Argentina   45167000
3   Colombia   48922000
2     Espana   47099000
0     Mexico  127212000

## Agregar una columna

In [183]:
#[1964375, 2780400, 505944, 1142748]
df['Superficie'] =  [1964375, 2780400, 505944, 1142748]
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748

### Asigno mismo valor a todas las filas en una columna nueva

In [184]:
#mismo valor "Futbol" a nueva columna Deporte
df['Deporte'] = 'Futbol'
df

        Pais  Poblacion  Superficie Deporte
1  Argentina   45167000     1964375  Futbol
3   Colombia   48922000     2780400  Futbol
2     Espana   47099000      505944  Futbol
0     Mexico  127212000     1142748  Futbol

## Eliminar una columna

In [185]:
#elimina columna deporte
df.drop(['Deporte'], axis=1, inplace=True)
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748

## Eliminar multiples columnas

In [186]:
#elimina columna superficie y pais
df.drop(['Pais', 'Superficie'], axis=1)
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748

In [187]:
df # recuerda! como no lo asignamos, el df anterior sigue "intacto"

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748

## Agregar una fila nueva al final

In [188]:
 # obtengo la cantidad de filas
cantidad_filas = len(df)
cantidad_filas

4

In [189]:
#agregar fila ["Benezuela", 0, 916445] # Está mal escrito el pais! (lo sé) # queremos el df.loc[4]
df.loc[cantidad_filas] = ["Benezuela", 0, 916445]
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748
4  Benezuela          0      916445

### Actualizo la fila entera

In [190]:
# corrige la falta ortpgráfica
df.replace({"Benezuela": "Venezuela"}, inplace=True)
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748
4  Venezuela          0      916445

### Actualizo una celda

In [191]:
#rellena valor a 0 por 32423000
df['Poblacion'].replace({0:32423000}, inplace=True)
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748
4  Venezuela   32423000      916445

## Eliminar una fila

In [194]:
#elimina con drop fila id=3
df.drop([3])
df

        Pais  Poblacion  Superficie  Habit_x_km2
1  Argentina   45167000     1964375           22
3   Colombia   48922000     2780400           17
2     Espana   47099000      505944           93
0     Mexico  127212000     1142748          111
4  Venezuela   32423000      916445           35

In [195]:
#elimina con drop fila id=3
deleted_row = df.drop([3], axis=0)
deleted_row

        Pais  Poblacion  Superficie  Habit_x_km2
1  Argentina   45167000     1964375           22
2     Espana   47099000      505944           93
0     Mexico  127212000     1142748          111
4  Venezuela   32423000      916445           35

## Eliminar multiples filas

In [196]:
eliminados = df.drop([1, 2], axis=0)
eliminados

        Pais  Poblacion  Superficie  Habit_x_km2
3   Colombia   48922000     2780400           17
0     Mexico  127212000     1142748          111
4  Venezuela   32423000      916445           35

# Filtrar

## Paises con mas de 46 millones de habitantes

In [197]:
df_new = df[df.Poblacion > 46000000]
df_new

       Pais  Poblacion  Superficie  Habit_x_km2
3  Colombia   48922000     2780400           17
2    Espana   47099000      505944           93
0    Mexico  127212000     1142748          111

## Más de 46 mill y superficie menor a 600.000 Km2

In [198]:
df_new = df[df.Superficie < 600000]
df_new

     Pais  Poblacion  Superficie  Habit_x_km2
2  Espana   47099000      505944           93

## Busco por un valor específico

In [199]:
#busca fila donde pais sea Colombia
name = df.loc[:, 'Pais'] == 'Colombia'
df[name]

       Pais  Poblacion  Superficie  Habit_x_km2
3  Colombia   48922000     2780400           17

## Paises con nombre mayor a 6 letras

In [200]:
df[df['Pais'].str.len() > 6]

        Pais  Poblacion  Superficie  Habit_x_km2
1  Argentina   45167000     1964375           22
3   Colombia   48922000     2780400           17
4  Venezuela   32423000      916445           35

## Obtener el indice de una fila

In [201]:
#obtener indice pais=colombia
df[df['Pais'] == 'Colombia'].index[0]

3

# Aplicar operaciones entre columnas

In [202]:
# agregamos en una nueva columna  Habit_x_km2 el ratio de habitantes por superficie
df['Habit_x_km2'] = df['Poblacion'] // df['Superficie'].astype(int)
df

        Pais  Poblacion  Superficie  Habit_x_km2
1  Argentina   45167000     1964375           22
3   Colombia   48922000     2780400           17
2     Espana   47099000      505944           93
0     Mexico  127212000     1142748          111
4  Venezuela   32423000      916445           35